# ლექცია 18: L18_2024-02-01

# ლექცია ჩატარდა 2024 წლის 1 თებერვალს
# თემა: მეტაკლასები

#*******************************************************************#

# საჭირო ბიბლიოთეკების შემოტანა 

import os

#*******************************************************************#

# ლექციის კოდი 

# კითხვები წინა მასალებიდან (L18_2024-02-01-)

# აქ შეიყვანე თემის დასახელება (L18_2024-02-01-)

print("\n",
	"-------------------------- part 0 --------------------------",
	"\n")






# მიმდინარე ლექციის თემა (L18_2024-02-01-)

print("\n",
	"-------------------------- part 1 --------------------------",
	"\n")

print(os.getcwd())
os.chdir(r".\Lectures")  # სამუშაო დირექტორიის შეცვლა.
print(os.getcwd())

