# ლექცია 20: L18_2024-02-08

# ლექცია ჩატარდა 2024 წლის 8 თებერვალს
# თემა: 

#*******************************************************************#

# საჭირო ბიბლიოთეკების შემოტანა 

import os

#*******************************************************************#

# ლექციის კოდი 

# კითხვები წინა მასალებიდან (L20_2024-02-08-)

# აქ შეიყვანე თემის დასახელება (L20_2024-02-08-)

print("\n",
	"-------------------------- part 0 --------------------------",
	"\n")






# მიმდინარე ლექციის თემა (L20_2024-02-08-)

print("\n",
	"-------------------------- part 1 --------------------------",
	"\n")

print(os.getcwd())
os.chdir(r".\Lectures")  # სამუშაო დირექტორიის შეცვლა.
print(os.getcwd())



# ლექციის მიმდინარეობისას ჩემით აწყობილი კოდი