# დავალება 16

# შემსრულებელი: გიორგი ცუცქირიძე

# ეს დავალება მოგვცეს მეთექვსმეტე ლექციაზე, რომელიც ჩატარდა 
# 2024-01-25-ში და დავალების ჩაბარების ბოლო ვადაა 2024-02-01.

#******************************************************************#

print("\n",
      "-------------------- სავარჯიშო 1 --------------------", "\n")

## სავარჯიშო 1




print("\n",
      "-------------------- სავარჯიშო 2 --------------------", "\n")

## სავარჯიშო 2




print("\n",
      "-------------------- სავარჯიშო 3 --------------------", "\n")

## სავარჯიშო 3




print("\n",
      "-------------------- სავარჯიშო 3 --------------------", "\n")

## სავარჯიშო 4




#------------------------------------------------------------------#